# Taps
tap "github/bootstrap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "octo-cli/octo"

# Formulae
brew "archey4"                       # Simple system information tool written in Python
brew "azure-cli"                     # Microsoft Azure CLI 2.0
brew "bash"                          # Bourne-Again SHell, a UNIX command interpreter
brew "bats-core"                     # Bash Automated Testing System
brew "cowsay"                        # Configurable talking characters in ASCII art
brew "dasel"                         # JSON, YAML, TOML, XML, and CSV query and modification tool
brew "dos2unix"                      # Convert text between DOS, UNIX, and Mac formats
brew "exercism"                      # Command-line tool to interact with exercism.io
brew "fish"                          # User-friendly command-line shell for UNIX-like operating systems
brew "fortune"                       # Infamous electronic fortune-cookie generator
brew "fzf"                           # Command-line fuzzy finder written in Go
brew "gh"                            # GitHub command-line tool
brew "gibo"                          # Access GitHub's .gitignore boilerplates
brew "git"                           # Distributed revision control system
brew "git-filter-repo"               # Quickly rewrite git repository history
brew "git-lfs"                       # Git extension for versioning large files
brew "git-sizer"                     # Compute various size metrics for a Git repository
brew "grex"                          # Command-line tool for generating regular expressions
brew "hadolint"                      # Smarter Dockerfile linter to validate best practices
brew "httpie"                        # User-friendly cURL replacement (command-line HTTP client)
brew "jq"                            # Lightweight and flexible command-line JSON processor
brew "libyaml"                       # YAML Parser
brew "node"                          # Platform built on V8 to build network applications
brew "markdownlint-cli"              # CLI for Node.js style checker and lint tool for Markdown files
brew "mas"                           # Mac App Store command-line interface
brew "neofetch"                      # Fast, highly customisable system info script
brew "nodenv"                        # Manage multiple NodeJS versions
brew "nyancat"                       # Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "onefetch"                      # Command-line Git information tool
brew "pandoc"                        # Swiss-army knife of markup format conversion
brew "pipenv"                        # Python dependency management tool
brew "pyenv"                         # Python version management
brew "rbenv"                         # Ruby version manager
brew "rbenv-default-gems"            # Auto-installs gems for Ruby installs
brew "shellcheck"                    # Static analysis and lint tool, for (ba)sh scripts
brew "shfmt"                         # Autoformat shell script source code
brew "speedtest-cli"                 # Command-line interface for https://speedtest.net bandwidth tests
brew "starship"                      # Cross-shell prompt for astronauts
brew "textql"                        # Executes SQL across text files
brew "tldr"                          # Simplified and community-driven man pages
brew "tmux"                          # Terminal multiplexer
brew "tree"                          # Display directories as trees (with optional color/HTML output)
brew "wget"                          # Internet file retriever
brew "yarn"                          # JavaScript package manager
brew "youtube-dl"                    # Download YouTube videos from the command-line
brew "yq"                            # Process YAML documents from the CLI
brew "zsh-autosuggestions"           # Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-syntax-highlighting"       # Fish shell like syntax highlighting for zsh

# Casks
cask "1password"                     # Password manager that keeps all passwords secure behind one password
cask "1password-cli"                 # Command-line helper for the 1Password password manager
cask "aerial"                        # Apple TV Aerial screensaver
cask "brave-browser"                 # Web browser focusing on privacy
cask "caldigit-thunderbolt-charging" # Improved Apple device support
cask "cleanshot"                     # Screen capturing tool
cask "cryptomator"                   # Multi-platform client-side cloud file encryption tool
cask "deckset"                       # Presentations from Markdown
cask "discord"                       # Voice and text chat software
cask "docker"                        # App to build and share containerized applications and microservices
cask "elgato-control-center"         # Control your Elgato Key Lights
cask "elgato-wave-link"              # Software custom-built for content creation
cask "encryptme"                     # VPN and encryption software
cask "font-fira-code-nerd-font"      # Developer targeted fonts with a high number of glyphs
cask "fujitsu-scansnap-home"         # Fujitsu ScanSnap Scanner software
cask "github"                        # Desktop client for GitHub repositories
cask "hyper"                         # Terminal built on web technologies
cask "imageoptim"                    # Tool to optimize images to a smaller size
cask "insomnia"                      # HTTP and GraphQL Client
cask "krisp"                         # Sound clear in online meetings
cask "latest"                        # Utility that shows the latest app updates
cask "logitech-camera-settings"      # Provides access to camera controls
cask "logitech-options"              # Software for Logitech devices
cask "mark-text"                     # Simple and elegant markdown editor
cask "messenger"                     # Native desktop app for Messenger (formerly Facebook Messenger)
cask "microsoft-teams"               # Meet, chat, call, and collaborate in just one place
cask "nteract"                       # Interactive computing suite
cask "numi"                          # Calculator and converter application
cask "obsidian"                      # Knowledge base that works on top of a local folder of plain text Markdown files
cask "osxfuse"                       # File system integration
cask "pdf-expert"                    # PDF reader, editor and annotator
cask "quitter"                       # Automatically hides or quits apps after periods of inactivity
cask "raycast"                       # Control your tools with a few keystrokes
cask "signal"                        # Instant messaging application focusing on security
cask "soundsource"                   # Sound and audio controller
cask "temurin8"                      # JDK from the Eclipse Foundation (Adoptium)
cask "timemachineeditor"             # Utility to change the default backup interval of Time Machine
cask "ubiquiti-unifi-controller"     # Set up, configure, manage and analyze your UniFi network
cask "vanilla"                       # Tool to hide menu bar icons
cask "visual-studio-code"            # Open-source code editor
cask "vlc"                           # Multimedia player
cask "zoom"                          # Video communication and virtual meeting platform

# Mac App Store
mas "1Password for Safari", id: 1569813296
mas "Bear", id: 1091189122
mas "Drafts", id: 1435957248
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "Home Assistant", id: 1099568401
mas "Hush", id: 1544743900
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LG Screen Manager", id: 1142051783
mas "Marked 2", id: 890031187
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Redacted", id: 984968384
mas "Shazam", id: 897118787
mas "Speedtest", id: 1153157709
mas "StopTheMadness", id: 1376402589
mas "The Jackbox Party Pack", id: 957862217
mas "The Jackbox Party Pack 2", id: 1034034328
mas "Things", id: 904280696
mas "Transmit", id: 1436522307
