# Taps
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "vitorgalvao/tiny-scripts"

# Formulae
brew "archey"                   # Graphical system information display for macOS
brew "azure-cli"                # A set of commands used to create and manage Azure resources
brew "bats-core"                # TAP-compliant test framework for Bash scripts (Bash Automated Testing System)
brew "cowsay"                   # Configurable talking characters in ASCII art
brew "dos2unix"                 # Convert text between DOS, UNIX, and Mac formats
brew "exercism"                 # Command-line tool to interact with exercism.io
brew "fortune"                  # Infamous electronic fortune-cookie generator
brew "gh"                       # GitHub command-line tool
brew "gibo"                     # Access GitHub's .gitignore boilerplates
brew "git"                      # Free and open source distributed version control system
brew "git-filter-repo"          # Quickly rewrite git repository history
brew "git-lfs"                  # Git extension for versioning large files
brew "git-sizer"                # Compute various size metrics for a Git repository
brew "grex"                     # Command-line tool for generating regular expressions
brew "httpie"                   # User-friendly cURL replacement (command-line HTTP client)
brew "jq"                       # Lightweight and flexible command-line JSON processor
brew "mas"                      # Mac App Store command-line interface
brew "node"                     # Platform built on V8 to build network applications
brew "nodenv"                   # Manage multiple NodeJS versions
brew "pandoc"                   # Swiss-army knife of markup format conversion
brew "pipenv"                   # Python development workflow for humans
brew "pyenv"                    # Simple Python version management
brew "q"                        # Run SQL directly on CSV or TSV files
brew "rbenv"                    # Ruby version manager
brew "shellcheck"               # Static analysis and lint tool, for (ba)sh scripts
brew "shfmt"                    # Autoformat shell script source code
brew "speedtest-cli"            # Command-line interface for https://speedtest.net bandwidth tests
brew "starship"                 # The cross-shell prompt for astronauts
brew "textql"                   # Executes SQL across text files
brew "tldr"                     # Simplified and community-driven man pages
brew "tmux"                     # Terminal multiplexer
brew "tree"                     # List contents of directories in a tree-like format
brew "wget"                     # Internet file retriever
brew "yarn"                     # JavaScript package manager (NPM alternative)
brew "youtube-dl"               # Download YouTube videos from the command-line
brew "yq"                       # Lightweight and portable command-line YAML processor
brew "zsh-autosuggestions"      # Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-syntax-highlighting"  # Fish shell like syntax highlighting for zsh

# Casks
cask "1password"                # Password manager
cask "1password-cli"            # 1Password command-line tool
cask "aerial"                   # Apple TV Aerial Screensaver for Mac
cask "alfred"                   # Application launcher and productivity application
cask "appcleaner"               # Thoroughly uninstall unwanted apps
cask "brave-browser"            # Secure, fast & private web browser with adblocker
cask "cryptomator"              # Client-side encryption of your files in the cloud
cask "deckset"                  # Creates great-looking slides from simple Markdown files
cask "discord"                  # Voice and text chat software
cask "elgato-camera-hub"        # Elgato Facecam configuration tool
cask "elgato-control-center"    # Control your Elgato Key Lights
cask "elgato-wave-link"         # Audio mixing software for Elgato Wave microphones
cask "encryptme"                # VPN and encryption software
cask "font-fira-code-nerd-font" # Monospaced font with programming ligatures
cask "fujitsu-scansnap-home"    # One stop for all ScanSnap productivity
cask "github"                   # Simple collaboration from your desktop
cask "google-drive"             # Access and sync your content from any device
cask "gpg-suite"                # Tools to protect your emails and files
cask "imageoptim"               # Tool to optimize images to a smaller size
cask "insomnia"                 # Cross-platform GraphQL and REST client
cask "kindle"                   # Interface for reading and syncing eBooks
cask "krisp"                    # Removes background noise and echo from meetings
cask "latest"                   # Open source macOS software update checker
cask "logitech-options"         # Customize Logitech device settings
cask "mark-text"                # Simple and Elegant Markdown Editor
cask "messenger"                # Native desktop app for Messenger (formerly Facebook Messenger)
cask "microsoft-teams"          # Microsoft Teams
cask "nteract"                  # Interactive computing suite
cask "numi"                     # Beautiful calculator app for macOS
cask "obs"                      # Open-source software for live streaming and screen recording (Open Broadcaster Software)
cask "octoscreen"               # A screensaver with Octicons
cask "osxfuse"                  # Extends macOS by adding support for user space file systems
cask "pdf-expert"               # PDF editor and reader for Mac
cask "rectangle"                # Move and resize windows using keyboard shortcuts or snap areas
cask "rocket"                   # Emoji picker
cask "signal"                   # Cross-platform encrypted messaging service
cask "soundsource"              # Sound and audio controller
cask "timemachineeditor"        # Utility to change the default backup interval of Time Machine
cask "vanilla"                  # Tool to hide menu bar icons
cask "visual-studio-code"       # Open-source code editor
cask "vlc"                      # Free and open source cross-platform multimedia player
cask "zoom"                     # Video conferencing software

# Mac App Store
mas "Bear", id: 1091189122                  # Note-taking app
mas "Gifski", id: 1351639930                # Convert videos to high-quality GIFs
mas "LG Screen Manager", id: 1142051783     # LG monitor software updates
mas "Magnet", id: 441258766                 # Window management tool
mas "Newton", id: 1059655371                # Email client
mas "Redacted", id: 984968384               # Quickly and easily redact parts of an image
mas "Speedtest", id: 1153157709             # One-click connection testing
mas "Things", id: 904280696                 # Task manager
