# Taps
tap "github/bootstrap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "macos-fuse-t/cask"

# Formulae
brew "actionlint"                  # Static checker for GitHub Actions workflow files
brew "archey4"                     # Simple system information tool written in Python
brew "libyaml"                     # YAML Parser
brew "bandit"                      # Security-oriented static analyser for Python code
brew "bash"                        # Bourne-Again SHell, a UNIX command interpreter
brew "bats-core"                   # Bash Automated Testing System
brew "cowsay"                      # Configurable talking characters in ASCII art
brew "curl"                        # Get a file from an HTTP, HTTPS or FTP server
brew "dasel"                       # JSON, YAML, TOML, XML, and CSV query and modification tool
brew "dos2unix"                    # Convert text between DOS, UNIX, and Mac formats
brew "exercism"                    # Command-line tool to interact with exercism.io
brew "fish"                        # User-friendly command-line shell for UNIX-like operating systems
brew "fortune"                     # Infamous electronic fortune-cookie generator
brew "fzf"                         # Command-line fuzzy finder written in Go
brew "gh"                          # GitHub command-line tool
brew "gibo"                        # Access GitHub's .gitignore boilerplates
brew "git"                         # Distributed revision control system
brew "git-filter-repo"             # Quickly rewrite git repository history
brew "git-lfs"                     # Git extension for versioning large files
brew "git-sizer"                   # Compute various size metrics for a Git repository
brew "go"                          # Open source programming language to build simple/reliable/efficient software
brew "grex"                        # Command-line tool for generating regular expressions
brew "hadolint"                    # Smarter Dockerfile linter to validate best practices
brew "httpie"                      # User-friendly cURL replacement (command-line HTTP client)
brew "jq"                          # Lightweight and flexible command-line JSON processor
brew "libfaketime"                 # Report faked system time to programs
brew "lychee"                      # Fast, async, resource-friendly link checker
brew "node"                        # Platform built on V8 to build network applications
brew "markdownlint-cli2"           # Fast, flexible, config-based cli for linting Markdown/CommonMark files
brew "mas"                         # Mac App Store command-line interface
brew "ncc"                         # Compile a Node.js project into a single file
brew "neofetch"                    # Fast, highly customisable system info script
brew "nodenv"                      # Manage multiple NodeJS versions
brew "nyancat"                     # Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "ocrmypdf"                    # Adds an OCR text layer to scanned PDF files
brew "onefetch"                    # Command-line Git information tool
brew "pandoc"                      # Swiss-army knife of markup format conversion
brew "pipenv"                      # Python dependency management tool
brew "pyenv"                       # Python version management
brew "rbenv"                       # Ruby version manager
brew "rbenv-default-gems"          # Auto-installs gems for Ruby installs
brew "shellcheck"                  # Static analysis and lint tool, for (ba)sh scripts
brew "shfmt"                       # Autoformat shell script source code
brew "speedtest-cli"               # Command-line interface for https://speedtest.net bandwidth tests
brew "starship"                    # Cross-shell prompt for astronauts
brew "stow"                        # Organize software neatly under a single directory tree (e.g. /usr/local)
brew "texlive"                     # Free software distribution for the TeX typesetting system
brew "thefuck"                     # Programmatically correct mistyped console commands
brew "tldr"                        # Simplified and community-driven man pages
brew "tmux"                        # Terminal multiplexer
brew "trash"                       # CLI tool that moves files or folder to the trash
brew "tree"                        # Display directories as trees (with optional color/HTML output)
brew "wget"                        # Internet file retriever
brew "yamllint"                    # Linter for YAML files
brew "yarn"                        # JavaScript package manager
brew "youtube-dl"                  # Download YouTube videos from the command-line
brew "yq"                          # Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "zsh-autosuggestions"         # Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-syntax-highlighting"     # Fish shell like syntax highlighting for zsh

# Casks
cask "1password"                   # Password manager that keeps all passwords secure behind one password
cask "1password-cli"               # Command-line interface for 1Password
cask "arc"                         # Chromium based browser
cask "bartender"                   # Menu bar icon organizer
cask "cleanshot"                   # Screen capturing tool
cask "cryptomator"                 # Multi-platform client-side cloud file encryption tool
cask "dash"                        # API documentation browser and code snippet manager
cask "deckset"                     # Presentations from Markdown
cask "discord"                     # Voice and text chat software
cask "elgato-control-center"       # Control your Elgato key lights
cask "elgato-wave-link"            # Software custom-built for content creation
cask "font-fira-code-nerd-font"    # Developer targeted fonts with a high number of glyphs
cask "font-monaspace"              # Superfamily of fonts for code
cask "fujitsu-scansnap-home"       # Fujitsu ScanSnap Scanner software
cask "fuse-t"                      # LibFUSE implementation that doesn't use kernel extensions
cask "github"                      # Desktop client for GitHub repositories
cask "gpg-suite"                   # Tools to protect your emails and files
cask "imageoptim"                  # Tool to optimize images to a smaller size
cask "insomnia"                    # HTTP and GraphQL Client
cask "microsoft-teams"             # Meet, chat, call, and collaborate in just one place
cask "notion"                      # App to write, plan, collaborate, and get organized
cask "nteract"                     # Interactive computing suite
cask "numi"                        # Calculator and converter application
cask "obsidian"                    # Knowledge base that works on top of a local folder of plain text Markdown files
cask "pdf-expert"                  # PDF reader, editor and annotator
cask "quitter"                     # Automatically hides or quits apps after periods of inactivity
cask "raycast"                     # Control your tools with a few keystrokes
cask "signal"                      # Instant messaging application focusing on security
cask "slack"                       # Team communication and collaboration software
cask "temurin8"                    # JDK from the Eclipse Foundation (Adoptium)
cask "timemachineeditor"           # Utility to change the default backup interval of Time Machine
cask "ubiquiti-unifi-controller"   # Set up, configure, manage and analyze your UniFi network
cask "utm"                         # Virtual machines UI using QEMU
cask "visual-studio-code"          # Open-source code editor
cask "yubico-yubikey-manager"      # Application for configuring any YubiKey
cask "zoom"                        # Video communication and virtual meeting platform

# Mac App Store
mas "1Password for Safari", id: 1569813296
mas "Bear", id: 1091189122
mas "Drafts", id: 1435957248
mas "Gifski", id: 1351639930
mas "Hush", id: 1544743900
mas "LG Screen Manager", id: 1142051783
mas "Marked 2", id: 890031187
mas "PDFZone", id: 1215383084
mas "Pixelmator Pro", id: 1289583905
mas "Redacted", id: 984968384
mas "Soulver 3", id: 1508732804
mas "Speedtest", id: 1153157709
mas "StopTheMadness", id: 1376402589
mas "TestFlight", id: 899247664
mas "Things", id: 904280696
