1password.op-vscode
bierner.github-markdown-preview
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bierner.markdown-yaml-preamble
charliermarsh.ruff
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
dnicolson.binary-plist
donjayamanne.githistory
eamodio.gitlens
editorconfig.editorconfig
ericadamski.carbon-now-sh
esbenp.prettier-vscode
exiasr.hadolint
fnando.linter
foxundermoon.shell-format
github.codespaces
github.copilot
github.copilot-chat
github.github-vscode-theme
github.remotehub
github.vscode-codeql
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
hbenl.vscode-test-explorer
humao.rest-client
james-yu.latex-workshop
jasonnutter.vscode-codeowners
jetmartin.bats
johnpapa.vscode-peacock
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode.azure-repos
ms-vscode.live-server
ms-vscode.remote-repositories
ms-vscode.test-adapter-converter
ms-vscode.vscode-github-issue-notebooks
ms-vsliveshare.vsliveshare
msyyn.liquify
pascalreitermann93.vscode-yaml-sort
pomber.git-file-history
redhat.vscode-yaml
richie5um2.vscode-sort-json
shopify.ruby-lsp
shopify.theme-check-vscode
sissel.shopify-liquid
sleistner.vscode-fileutils
standard.vscode-standard
streetsidesoftware.code-spell-checker
taichi.vscode-textlint
tamasfe.even-better-toml
timonwong.shellcheck
tlevesque2.duplicate-finder
tumido.cron-explained
tyriar.lorem-ipsum
valentjn.vscode-ltex
wallabyjs.quokka-vscode
wayou.vscode-todo-highlight
yzhang.markdown-all-in-one
